const boss_names = [
  "ゴブリングレート",
  "ワイバーン",
  "ワイルドグリフォン",
  "ライライ",
  "ランドスロース",
  "ライデン",
  "シードレイク",
  "バジリスク",
  "ニードルクリーパー",
  "オークチーフ",
  "スカイワルキューレ",
  "レイスロード",
  "マダムプリズム",
  "ムシュフシュ",
  "ジャッカルシーフ",
  "メガラバーン",
  "ムーバ",
  "トライロッカー",
  "スピリットホーン",
  "ティタノタートル",
  "オブシダンワイバーン",
  "ウールヴヘジン",
  "ネプテリオン",
  "ダークガーゴイル",
  "マッドベア",
  "サイクロプス",
  "アクアリオス",
  "トルペドン",
  "メサルティム",
  "ミノタウロス",
  "ツインピッグス",
  "カルキノス",
  "オルレオン",
  "メデューサ",
  "グラットン",
  "レサトパルト",
  "サジタリウス",
  "アルゲティ",
];

// 統一的なルールでは無理があるような名前の変換用データ
const nick_names = [
  ["アカリ（エンジェル）", "アカリエル"],
  ["アヤネ（クリスマス）", "クリネ"],
  ["アユミ（ワンダー）", "ワユミ"],
  ["イノリ（タイムトラベル）", "イノベル"],
  ["イリヤ（クリスマス）", "クリヤ"],
  ["エリコ（バレンタイン）", "バリコ"],
  ["カヤ（タイムトラベル）", "カヤベル"],
  ["キャル（ニューイヤー）", "ニャル"],
  ["キョウカ（ハロウィン）", "ハロキョ"],
  ["クウカ（オーエド）", "オウカ"],
  ["クリスティーナ", "クリス"],
  ["コッコロ（サマー）", "水コロ"],
  ["コッコロ（ニューイヤー）", "ニュッコロ"],
  ["コッコロ（プリンセス）", "プリコロ"],
  ["コッコロ（儀装束）", "ギッコロ"],
  ["サレン（サマー）", "ミレン"],
  ["シズル（バレンタイン）", "バレシズ"],
  ["シノブ（ハロウィン）", "ハロシノ"],
  ["スズナ（サマー）", "ミズナ"],
  ["スズメ（ニューイヤー）", "ニュズメ"],
  ["タマキ（サマー）", "水タマ"],
  ["タマキ（作業服）", "作タマ"],
  ["ツムギ（サマー）", "水ツム"],
  ["ツムギ（ハロウィン）", "ハロツム"],
  ["トモ（マジカル）", "シャニトモ"],
  ["ニノン（オーエド）", "オノン"],
  ["ネネカ（ニューイヤー）", "ニュネカ"],
  ["ヒヨリ（ニューイヤー）", "ニュヨリ"],
  ["ヒヨリ（プリンセス）", "プヨリ"],
  ["シオリ（マジカル）", "ピュオリ"],
  ["ペコリーヌ", "ペコ"],
  ["マコト（サマー）", "ミコト"],
  ["マコト（シンデレラ）", "デレマコ"],
  ["ミサキ（ハロウィン）", "ハロミサ"],
  ["カスミ（マジカル）", "マジカス"],
  ["ミソギ（ハロウィン）", "ハロミサ"],
  ["ミフユ（サマー）", "水ユ"],
  ["ミヤコ（ハロウィン）", "ハロミヤ"],
  ["ムイミ（ニューイヤー）", "ニュイミ"],
  ["ユイ（ニューイヤー）", "ニュイ"],
  ["ヨリ（エンジェル）", "ヨリエル"],
  ["リノ（ワンダー）", "ワリノ"],
  ["リン（レンジャー）", "リンジャー"],
];

// 各衣裳でありがちな略称ルール
const ver_nick_headers = [
  ["（サマー）", "水"],
  ["（ハロウィン）", "ハロ"],
  ["（ニューイヤー）", "ニュ"],
  ["（儀装束）", "儀"],
  ["（作業服）", "作"],
  ["（バレンタイン）", "バレ"],
  ["（デレマス）", ""],
  ["（シンデレラ）", "デレ"],
  ["（クリスマス）", "クリ"],
  ["（プリンセス）", "プリ"],
];

export function is_boss(name: string) {
  return boss_names.includes(name);
}

export function translate_to_nick(name: string) {
  nick_names.forEach((nick_name_tuple) => {
    name = name.replace(nick_name_tuple[0], nick_name_tuple[1]);
  });
  for (let ver_nick_tuple of ver_nick_headers) {
    let index = name.indexOf(ver_nick_tuple[0]);
    if (index > -1) {
      name = ver_nick_tuple[1] + name.slice(0, index);
      break;
    }
  }
  return name;
}
